Revit 2027 API
ReferenceableViewUtils Methods
The ReferenceableViewUtils type exposes the following members.
Methods
Name | Description
ChangeReferencedView |  Changes a particular reference view (such as a reference section or reference callout) to refer to a different View.
GetReferencedViewId |  Gets the id of the view referenced by a reference view (such as a reference section or reference callout).
Top
See Also
Reference
ReferenceableViewUtils Class
Autodesk.Revit.DB Namespace